data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          260;
        startFace       529120;
    }
    outlet
    {
        type            patch;
        nFaces          260;
        startFace       529380;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1020;
        startFace       529640;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1020;
        startFace       530660;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          530400;
        startFace       531680;
    }
)

// ************************************************************************* //
