data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (34.6 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
        260
        (
            (20.31313952 0 0)
            (23.76496783 0 0)
            (25.56406478 0 0)
            (26.82287607 0 0)
            (27.80336813 0 0)
            (28.61194853 0 0)
            (29.30298186 0 0)
            (29.90818708 0 0)
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
