data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
265200
(
-1.3480147841
-1.3440441972
-1.34007352987
-1.33610293914
-1.33213235033
-1.32816176151
-1.3241911727
-1.32022058388
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
0.84
0.84
0.84
0.84
0.84
0.84
0.84
0.84
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
-1.34801470588
-1.34404411764
-1.34007352941
-1.33610294118
-1.33213235294
-1.3281617647
-1.32419117647
-1.32022058823
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
-1.3482917819
-1.34432589768
-1.34007514991
-1.33609574632
-1.33212310241
-1.3281504585
-1.3241778146
-1.32020517068
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
