data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.179574;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
        260
        (
            4.080921228
            4.623715942
            4.390630374
            3.929547846
            3.397403883
            2.863032652
            2.360783
            1.907920651
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 0.179574;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
