data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 316.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
        260
        (
            13365.02948
            4742.039128
            2772.581044
            1873.544728
            1716.947006
            1576.146028
            1431.236278
            1286.658981
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 316.0;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
