data/NASA_2DWMH_sweep/exp_tbl_sst_sharp_meshtop_220/system/singleGraph_x120
type            sets;
libs            ("libsampling.so");
writeControl    writeTime;
setFormat       raw;
interpolationScheme cell;

#include "../fieldDef"

fields          $singleGraphFields;

sets
(
    line
    {
        type        uniform;
        axis        xyz;
        nPoints     240;
        start       (0.504 0 0);
        end         (0.504 0.35 0);
    }
);
